Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsSettings.SetVisibility(System.Boolean)
Set visibility of the piece of DirectContext3D graphics.
A value of true means that the graphics are visible.

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsSettings.SetColor(Autodesk.Revit.DB.Color)
Set color for a piece of graphics in the DirectContext3D.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsSettings.Assign(Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsSettings)
Assigns values of the source data to this object.
other:
The source data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsSettings.IsEqual(Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsSettings)
Check if the contents of two graphics settings are equal.
other:
The settings to be compared.
Returns:
True for equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsSettings.Color
Override color for a piece of graphics in the DirectContext3D.

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsSettings.Visibility
Visibility of the piece of DirectContext3D graphics.
A value of true means that the graphics are visible.

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsSettings.#ctor(Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsSettings)
Constructs a copy of source object.
other:
Source object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsSettings.#ctor
Constructs an instance of settings with default values.

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsSettings
Settings for a piece of graphics of a DirectContext3D.